# 1.Користувач вводить строку
new_str = input('Ведіть строку:')

# 2.Програма переводить строку в нижній регістр
str_l = new_str.lower()

# 3.Програма видаляє зі строки такі символи пунктуації: .,-:;?!

str1 = str_l.replace(',', '')
str2 = str1.replace('.', '')
str3 = str2.replace('-', '')
str4 = str3.replace(':', '')
str5 = str4.replace(';', '')
str6 = str5.replace('?', '')
str7 = str6.replace('!', '')

# 4.Програма видаляє зайві пробіли\табуляції з правого кінця строки
str8 = str7.rstrip()

# 5.Програма питає користувача яке слово (або словосполучення) він бажає замінити
w_replace = input('Введіть слово яке треба замінити: ')

# 6.Програма повідомляє на якому індексі строки словосполучення присутнє
if str8.find(w_replace.lower()) < 0:
    w_replace = input('Словосполучення нема, введіть існуюче:')
print(f"Словосполучення присутнє на {str8.find(w_replace.lower())} місці")

# 7.Програма питає на яке слово треба замінити
change_word = input('Введіть слово на яке будемо міняти:')

# 8.Програма виводить відформатовану строку

print (f'Відформатована строка: {str8.replace(w_replace.lower(),change_word)}')
